#include <stdio.h>

/*int main() {
	// 1. 자료형
	// 2. 연산자
	//   ① 산술 연산자: +, -, *, /, %
	//   ② 할당(=대입) 연산자: =, +=, -=, *=, /=, %=, <<=
	//   ③ 증감 연산자
	//     ⑴ 전위: ++n, --n
	//     ⑵ 후위: n++, n--
	//   ④ 관계 연산자: >, <, ==, >=, <=, != (결과값: T / F)
	//   ⑤ 조건 연산자: 조건 ? T : F;
	//   ⑥ 논리 연산자: &&, ||, ! (결과값: T / F)
	//   ⑦ 비트 연산자: &, |, ~, ^
	//   ⑧ 시프트 연산자: <<, >>
	//   ⑨ 콤마 연산자: ,
	//   ⑩ 형변환 연산자: (자료형)
	//   ⑪ sizeof 연산자: sizeof(자료형)
	// 3. 제어문
	//   ① if문
	//		if (조건) 실행할 명령;
	//   ② if - else문
	//      if (조건) 실행할 명령;
	//      else 실행할 명령;
	//   ③ if - else if - else문
	//      if (조건) 실행할 명령;
	//		else if (조건) 실행할 명령;
	//		else 실행할 명령;
	//   ④ switch - case문
	//		switch (조건, 숫자(정수)나 문자(char))
	//		{
	//		case 1:
	//			실행할 명령;
	//			break;
	//		default:
	//			실행할 명령;
	//			break;
	//		}
	// 4. 반복문
	//   ① for문
	//      for(초기값; 조건; 중간문) 실행할 명령;
	//   ② while문
	//      while(조건) 실행할 명령;
	//   ③ do - while문
	//		do
	//		{
	//			실행할 명령;
	//
}*/